#!/bin/bash
# in CentOS 7.9 (utf-8 to euc-kr)

########################################################################################
## EUC-KR로 변경하기 위해 필요한 패키지를 설치
########################################################################################
$ sudo yum install glibc-common

########################################################################################
## view locale
########################################################################################
$ locale
LANG=
LC_CTYPE="POSIX"
LC_NUMERIC="POSIX"
LC_TIME="POSIX"
LC_COLLATE="POSIX"
LC_MONETARY="POSIX"
LC_MESSAGES="POSIX"
LC_PAPER="POSIX"
LC_NAME="POSIX"
LC_ADDRESS="POSIX"
LC_TELEPHONE="POSIX"
LC_MEASUREMENT="POSIX"
LC_IDENTIFICATION="POSIX"
LC_ALL=


########################################################################################
## set locale(1-UTF-8)
########################################################################################
$ sudo localedef -i ko_KR ko_KR.eucKR -f EUC-KR
##$ sudo localedef -c -i ko_KR -f UTF-8 ko_KR.UTF-8

$ cat kor.txt
한글abc1234한글



########################################################################################
## set permanently locale(1)
########################################################################################
$ sudo vi /etc/locale.conf
LANG=ko_KR.eucKR
#LANG=ko_KR.utf8

$ sudo reboot


########################################################################################
## set permanently locale(2)
########################################################################################
$ cat ~/.bashrc
## KOR
export LANG=ko_KR.eucKR
#export LC_ALL=ko_KR.UTF-8

. ~/.bashrc


########################################################################################
## set locale
########################################################################################
$ vi ~/.bash_profile

export LANG=ko_KR.eucKR
export LC_ALL=ko_KR.eucKR

#export LC_CTYPE=ko_KR.UTF-8
#export LC_ALL=ko_KR.UTF-8

locale


########################################################################################
## reboot
########################################################################################
$ sudo reboot
